app/Controllers/Activity/AdminActivity.php

SELECT `users`.*, `users`.`signature`, `users`.`position` as `user_position`, `divisions`.`name` as `division_name`, `departments`.`name` as `department_name`, `sub_departments`.`name` as `sub_department_name`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
LEFT JOIN `divisions` ON `divisions`.`id` = `users`.`division_id`
LEFT JOIN `sub_departments` ON `sub_departments`.`id` = `users`.`sub_department_id`
WHERE `users`.`id` = '3'
 LIMIT 1
---
    private function exportHistoryPdf($activities, $month, $year)
    {
        // Get user details with joined tables
        $userModel = new \App\Models\UserModel();
        $userData = $userModel->select('users.*, divisions.name as division_name, departments.name as department_name, sub_departments.name as sub_department_name')
            ->join('departments', 'departments.id = users.department_id', 'left')
            ->join('divisions', 'divisions.id = users.division_id', 'left')
            ->join('sub_departments', 'sub_departments.id = users.sub_department_id', 'left')
            ->where('users.id', user_id())
            ->first();