app/Models/Absensi/AbsensiModel.php

    public function checkAbsenHariIni($user_id)
    {
        return $this->select('absensi.*, absen_category.name as category_name')
            ->join('absen_category', 'absen_category.id = absensi.category_id')
            ->where([
                'absensi.user_id' => $user_id,
                'absensi.tanggal' => date('Y-m-d')
            ])
            ->orderBy('absensi.created_at', 'DESC')
            ->first();
---
SELECT `absensi`.*, `absen_category`.`name` as `category_name`
FROM `absensi`
JOIN `absen_category` ON `absen_category`.`id` = `absensi`.`category_id`
WHERE `absensi`.`user_id` = '1'
AND `absensi`.`tanggal` = '2025-01-23'
ORDER BY `absensi`.`created_at` DESC
 LIMIT 1

    public function getPendingAbsensi($user_id)
    {
        return $this->select('absensi.*, absen_category.name as category_name')
            ->join('absen_category', 'absen_category.id = absensi.category_id')
            ->where([
                'absensi.user_id' => $user_id,
                'absensi.status !=' => 'pulang'
            ])
            ->orderBy('absensi.tanggal', 'DESC')
            ->first();
---
SELECT `absensi`.*, `absen_category`.`name` as `category_name`, `absensi`.`tanggal_keluar`
FROM `absensi`
JOIN `absen_category` ON `absen_category`.`id` = `absensi`.`category_id`
WHERE `absensi`.`user_id` = '1'
AND `absensi`.`tanggal` >= '2025-01-01'
AND `absensi`.`tanggal` <= '2025-01-31'
ORDER BY `absensi`.`tanggal` DESC

    public function getSuperAdminHistory($startDate, $endDate, $categoryId = null, $userId = null)
    {
        $builder = $this->select('absensi.*, users.username as user_name, absen_category.name as category_name')
            ->join('users', 'users.id = absensi.user_id')
            ->join('auth_groups_users', 'auth_groups_users.user_id = absensi.user_id')
            ->join('absen_category', 'absen_category.id = absensi.category_id')
            ->where('auth_groups_users.group_id', 1)
            ->where('absensi.tanggal >=', $startDate)
            ->where('absensi.tanggal <=', $endDate)
            ->where('absensi.sign_pdf', 0);  // Only show unsigned documents

        // Optional filter by category
        if (!empty($categoryId)) {
            $builder->where('absensi.category_id', $categoryId);
        }

        // Optional filter by user
        if (!empty($userId) && $userId !== 'all') {
            $builder->where('absensi.user_id', $userId);
        }

        return $builder->orderBy('absensi.tanggal', 'DESC')
            ->findAll();
---
SELECT `absensi`.*, `users`.`username` as `user_name`, `absen_category`.`name` as `category_name`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`user_id`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `absensi`.`user_id`
JOIN `absen_category` ON `absen_category`.`id` = `absensi`.`category_id`
WHERE `auth_groups_users`.`group_id` = 1
AND `absensi`.`tanggal` >= '2025-02-01'
AND `absensi`.`tanggal` <= '2025-02-28'
AND `absensi`.`sign_pdf` = 0
AND `absensi`.`user_id` = '3'
ORDER BY `absensi`.`tanggal` DESC