app/Controllers/Absensi/Absensi.php

SELECT *
FROM `absen_category`
---

        // Load categories for dropdown
        $categoryModel = new \App\Models\Absensi\AbsenCategoryModel();
        $categories = $categoryModel->findAll();

SELECT `users`.*, `users`.`signature`, `users`.`position` as `user_position`, `divisions`.`name` as `division_name`, `departments`.`name` as `department_name`, `sub_departments`.`name` as `sub_department_name`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
LEFT JOIN `divisions` ON `divisions`.`id` = `users`.`division_id`
LEFT JOIN `sub_departments` ON `sub_departments`.`id` = `users`.`sub_department_id`
WHERE `users`.`id` = '5'
 LIMIT 1
---
    public function superadminHistory()
    {
        if (!logged_in()) {
            return redirect()->to('/login');
        }

        $selectedMonth = $this->request->getGet('month') ?? date('Y-m');
        $selectedCategory = $this->request->getGet('category');
        $selectedUser = $this->request->getGet('user');

        $startDate = date('Y-m-01', strtotime($selectedMonth));
        $endDate = date('Y-m-t', strtotime($selectedMonth));

        $userModel = new UserModel();
        $users = $userModel->getAllhistoryUsers();

        // Get current user details for signature
        $userId = user_id();
        $userDetails = $userModel->select('users.*, users.signature, users.position as user_position, divisions.name as division_name, departments.name as department_name, sub_departments.name as sub_department_name')
            ->join('departments', 'departments.id = users.department_id', 'left')
            ->join('divisions', 'divisions.id = users.division_id', 'left')
            ->join('sub_departments', 'sub_departments.id = users.sub_department_id', 'left')
            ->where('users.id', $userId)
            ->first();

SELECT *
FROM `absen_category`
---
        }

        $categoryModel = new \App\Models\Absensi\AbsenCategoryModel();
        $categories = $categoryModel->findAll();

SELECT `users`.*, `users`.`signature`, `users`.`position` as `user_position`, `divisions`.`name` as `division_name`, `departments`.`name` as `department_name`, `sub_departments`.`name` as `sub_department_name`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
LEFT JOIN `divisions` ON `divisions`.`id` = `users`.`division_id`
LEFT JOIN `sub_departments` ON `sub_departments`.`id` = `users`.`sub_department_id`
WHERE `users`.`id` = '3'
 LIMIT 1
---
    public function previewPdf()
    {
        // Validate AJAX request
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(400)
                ->setJSON(['success' => false, 'message' => 'Invalid request']);
        }

        try {
            // Get and validate parameters
            $userId = $this->request->getGet('userId');
            $selectedMonth = $this->request->getGet('month');
            $isSigned = $this->request->getGet('signed') === 'true';

            if (!$userId || !$selectedMonth) {
                throw new \Exception('Missing required parameters');
            }

            // Get user details with proper error handling
            $userModel = new UserModel();
            $userDetails = $userModel->select('users.*, users.signature, users.position as user_position, divisions.name as division_name, departments.name as department_name, sub_departments.name as sub_department_name')
                ->join('departments', 'departments.id = users.department_id', 'left')
                ->join('divisions', 'divisions.id = users.division_id', 'left')
                ->join('sub_departments', 'sub_departments.id = users.sub_department_id', 'left')
                ->where('users.id', $userId)
                ->first();