app/Controllers/GuestVisitorController.php

    public function history()
    {
        // Get filter parameters
        $monthFilter = $this->request->getGet('month') ?? date('Y-m');
        $userFilter = $this->request->getGet('user') ?? 'all';

        // Base query
        $query = $this->guestVisitorModel->select('guest_visitors.*, users.username as created_by')
            ->join('users', 'users.id = guest_visitors.user_id');

        // Apply filters
        if ($monthFilter) {
            $query->where("DATE_FORMAT(guest_visitors.created_at, '%Y-%m')", $monthFilter);
        }

        if ($userFilter !== 'all') {
            $query->where('guest_visitors.user_id', $userFilter);
        }

        // Get users for filter dropdown
        $userModel = new \App\Models\UserModel();
        $users = $userModel->getAllhistoryUsers();

        $data = [
            'title' => 'Guest Visitor History',
            'guests' => $query->orderBy('guest_visitors.created_at', 'DESC')->findAll(),
---
SELECT `guest_visitors`.*, `users`.`username` as `created_by`
FROM `guest_visitors`
JOIN `users` ON `users`.`id` = `guest_visitors`.`user_id`
WHERE DATE_FORMAT(guest_visitors.created_at, '%Y-%m') = '2025-02'
ORDER BY `guest_visitors`.`created_at` DESC