app/Controllers/Pages.php

    public function index()
    {
        // Load text helper (if using character_limiter)
        helper('text');

        // Get the logged-in user's ID
        $userId = user()->id;

        // Get user groups
        $userGroups = $this->getUserGroups($userId);

        // Fetch articles based on user groups
        $articles = $this->articleModel->getArticlesForUser($userGroups);

        // Fetch categories
        $categories = $this->categoryModel->findAll();
---
SELECT *
FROM `categories`

    private function getUserGroupId($userId)
    {
        $group = $this->db->table('auth_groups_users')
            ->where('user_id', $userId)
            ->get()
            ->getFirstRow();

        return $group ? $group->group_id : null;
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '5'

    private function getUserGroups($userId)
    {
        // Ambil data grup pengguna langsung dari tabel `users`
        return $this->db->table('users')
            ->select('directorate_id, division_id, department_id, sub_department_id')
            ->where('id', $userId)
            ->get()
            ->getRowArray();
---
SELECT `directorate_id`, `division_id`, `department_id`, `sub_department_id`
FROM `users`
WHERE `id` IS NULL

    public function publication()
    {
        helper('text');

        $userId = user()->id;
        $userGroups = $this->getUserGroups($userId);
        $files = $this->fileUploadModel->getFileForUser($userGroups);
        $categories = $this->categoryModel->findAll();
---
SELECT *
FROM `categories`