app/Controllers/PjAssignmentController.php

    public function getUsers($aplikasi_id)
    {
        // Get all users mapped to this application
        $mappings = $this->mappingModel->where('aplikasi_id', $aplikasi_id)->findAll();

        $users = [];
        foreach ($mappings as $mapping) {
            $status = $this->pjStatusModel->where('mapping_id', $mapping['id'])->first();
---
SELECT *
FROM `mapping`
WHERE `aplikasi_id` = '2'
SELECT *
FROM `pj_status`
WHERE `mapping_id` = '2'
 LIMIT 1