app/Models/AdminActivityModel.php

    public function getAdminActivities($userId, $startDate = null, $endDate = null)
    {
        $builder = $this->db->table('admin_activities a')
            ->select('a.*, u.username')
            ->join('users u', 'u.id = a.user_id')
            ->join('auth_groups_users agu', 'agu.user_id = u.id')
            ->where('agu.group_id', 1)
            ->where('a.user_id', $userId);

        if ($startDate && $endDate) {
            $builder->where('a.activity_date >=', $startDate)
                ->where('a.activity_date <=', $endDate);
        }

        return $builder->orderBy('a.activity_date', 'ASC')
            ->orderBy('a.start_time', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `a`.*, `u`.`username`
FROM `admin_activities` `a`
JOIN `users` `u` ON `u`.`id` = `a`.`user_id`
JOIN `auth_groups_users` `agu` ON `agu`.`user_id` = `u`.`id`
WHERE `agu`.`group_id` = 1
AND `a`.`user_id` = '1'
AND `a`.`activity_date` >= '2025-2-01'
AND `a`.`activity_date` <= '2025-02-28'
ORDER BY `a`.`activity_date` ASC, `a`.`start_time` ASC

    public function getAllAdminActivities($startDate = null, $endDate = null, $selectedUser = null, $showSigned = false)
    {
        $builder = $this->db->table('admin_activities a')
            ->select('a.*, u.username, u.signature')
            ->join('users u', 'u.id = a.user_id')
            ->join('auth_groups_users agu', 'agu.user_id = u.id')
            ->where('agu.group_id', 1);

        // Only filter for unsigned documents if showSigned is false
        if (!$showSigned) {
            $builder->where('a.sign_pdf', 0);
        }

        if ($startDate && $endDate) {
            $builder->where('a.activity_date >=', $startDate)
                ->where('a.activity_date <=', $endDate);
        }

        if ($selectedUser && $selectedUser !== 'all') {
            if (is_array($selectedUser)) {
                $builder->whereIn('a.user_id', $selectedUser);
            } else {
                $builder->where('a.user_id', $selectedUser);
            }
        }

        return $builder->orderBy('a.activity_date', 'DESC')
            ->orderBy('a.start_time', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `a`.*, `u`.`username`, `u`.`signature`
FROM `admin_activities` `a`
JOIN `users` `u` ON `u`.`id` = `a`.`user_id`
JOIN `auth_groups_users` `agu` ON `agu`.`user_id` = `u`.`id`
WHERE `agu`.`group_id` = 1
AND `a`.`activity_date` >= '2025-1-01'
AND `a`.`activity_date` <= '2025-01-31'
AND `a`.`user_id` = '3'
ORDER BY `a`.`activity_date` DESC, `a`.`start_time` DESC