app/Models/ArticleModel.php

    public function getArticlesForUser(array $userData): array
    {
        $builder = $this->db->table('articles a');
        // Select all article fields and concatenate category names
        $builder->select('a.*, GROUP_CONCAT(DISTINCT c.id) as category_ids, GROUP_CONCAT(DISTINCT c.name) AS category_names');

        // Join the article_distributions table
        $builder->join('article_distributions ad', 'a.id = ad.article_id', 'left');

        // Join the article_categories table to get category information
        $builder->join('article_categories ac', 'a.id = ac.article_id', 'left');
        $builder->join('categories c', 'ac.category_id = c.id', 'left');

        // Build user conditions
        $conditions = $this->buildUserConditions($userData);

        // Apply conditions if they exist
        if (!empty($conditions)) {
            $builder->where('(' . implode(' OR ', $conditions) . ')');
        }

        // Ensure only published articles are returned
        $builder->where('a.status', 'published');

        // Group by article ID to aggregate category names
        $builder->groupBy('a.id');
        $builder->orderBy('a.created_at', 'DESC');

        // Execute the query and return results
        return $builder->get()->getResultArray();
---
SELECT `a`.*, GROUP_CONCAT(DISTINCT c.id) as category_ids, GROUP_CONCAT(DISTINCT c.name) AS category_names
FROM `articles` `a`
LEFT JOIN `article_categories` `ac` ON `a`.`id` = `ac`.`article_id`
LEFT JOIN `categories` `c` ON `ac`.`category_id` = `c`.`id`
LEFT JOIN `article_distributions` `ad` ON `a`.`id` = `ad`.`article_id`
WHERE `a`.`status` = 'published'
GROUP BY `a`.`id`
ORDER BY `a`.`created_at` DESC