app/Models/FileUploadModel.php

    public function getFileForUser(?array $userData = null): array
    {
        $builder = $this->db->table('fileuploads a');
        // Select all file fields and concatenate category names
        $builder->select('a.*, GROUP_CONCAT(DISTINCT c.id) as category_id, GROUP_CONCAT(DISTINCT c.name) AS category_names');

        // Join the file_categories table to get category information
        $builder->join('file_categories ac', 'a.id = ac.fileuploads_id', 'left');
        $builder->join('categories c', 'ac.category_id = c.id', 'left');

        if ($userData) {
            // User sudah login, gunakan kondisi akses berdasarkan grup
            $builder->join('file_distributions ad', 'a.id = ad.fileuploads_id', 'left');
            $conditions = $this->buildUserConditions($userData);
            if (!empty($conditions)) {
                $builder->where('(' . implode(' OR ', $conditions) . ')');
            }
        } else {
            // User belum login, hanya tampilkan artikel public
            $builder->where('a.type', 'public');
        }

        // Ensure only published file are returned
        $builder->where('a.status', 'published');

        // Group by file ID to aggregate category names
        $builder->groupBy('a.id');
        $builder->orderBy('a.created_at', 'DESC');

        // Execute the query and return results
        return $builder->get()->getResultArray();
---
SELECT `a`.*, GROUP_CONCAT(DISTINCT c.id) as category_id, GROUP_CONCAT(DISTINCT c.name) AS category_names
FROM `fileuploads` `a`
LEFT JOIN `file_categories` `ac` ON `a`.`id` = `ac`.`fileuploads_id`
LEFT JOIN `categories` `c` ON `ac`.`category_id` = `c`.`id`
WHERE `a`.`type` = 'public'
AND `a`.`status` = 'published'
GROUP BY `a`.`id`
ORDER BY `a`.`created_at` DESC