app/Models/GuestVisitorModel.php

SELECT `guest_visitors`.*, `users`.`username` as `created_by`
FROM `guest_visitors`
JOIN `users` ON `users`.`id` = `guest_visitors`.`user_id`
ORDER BY `guest_visitors`.`created_at` DESC
---
    public function getGuestsWithUserInfo()
    {
        return $this->select('guest_visitors.*, users.username as created_by')
            ->join('users', 'users.id = guest_visitors.user_id')
            ->orderBy('guest_visitors.created_at', 'DESC')
            ->findAll();