app/Models/MenuModel.php

SELECT *
FROM `menus`
WHERE `parent_id` IS NULL
AND `is_active` = 1
ORDER BY `order_pos` ASC
SELECT *
FROM `menus`
WHERE `parent_id` = '28'
AND `is_active` = 1
ORDER BY `order_pos` ASC
---
    public function getMenusByRole($roleId)
    {
        // Get menu permissions from role_menus table
        $roleMenus = $this->getRoleMenus($roleId);

        // Get all top level menus (both headers and standalone menus)
        $topLevelMenus = $this->where([
            'parent_id' => null,
            'is_active' => 1
        ])
            ->orderBy('order_pos', 'ASC')
            ->findAll();

        $structuredMenus = [];

        foreach ($topLevelMenus as $topMenu) {
            // Get first level children
            $firstLevelMenus = $this->where([
                'parent_id' => $topMenu['id'],
                'is_active' => 1
            ])
                ->orderBy('order_pos', 'ASC')
                ->findAll();

SELECT *
FROM `menus`
WHERE `parent_id` = '18'
AND `is_active` = 1
ORDER BY `order_pos` ASC
---
                $menu['has_access'] = in_array($menu['id'], $roleMenus);

                // Get submenus
                $subMenus = $this->where([
                    'parent_id' => $menu['id'],
                    'is_active' => 1
                ])
                    ->orderBy('order_pos', 'ASC')
                    ->findAll();

SELECT *
FROM `role_menus`
WHERE `role_id` = '3'
---
    private function getRoleMenus($roleId)
    {
        // Get menu IDs from role_menus table
        $db = db_connect();
        $builder = $db->table('role_menus');
        $permissions = $builder->where('role_id', $roleId)
            ->get()
            ->getResultArray();

SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '5'
---
    public function getCurrentUserRole()
    {
        $user = user();
        if ($user) {
            $groupModel = db_connect()->table('auth_groups_users');
            $userGroup = $groupModel->where('user_id', $user->id)->get()->getRowArray();