app/Models/SignPdfModel.php

    public function getSignedDocuments($selectedMonth = null, $selectedUser = null)
    {
        $builder = $this->builder();
        $builder->select('sign_pdf.*, users.username');
        $builder->join('users', 'users.id = sign_pdf.user_id');

        if ($selectedMonth) {
            $builder->where('periode', $selectedMonth);
        }

        if ($selectedUser && $selectedUser !== 'all') {
            $builder->where('user_id', $selectedUser);
        }

        return $builder->get()->getResultArray();
---
SELECT `sign_pdf`.*, `users`.`fullname`
FROM `sign_pdf`
JOIN `users` ON `users`.`id` = `sign_pdf`.`user_id`
WHERE `periode` = 'January_2025'
AND `user_id` = '1'