app/Models/UserModel.php

SELECT `users`.*
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `users`.`active` = 1
AND `auth_groups_users`.`group_id` = 1
ORDER BY `users`.`username` ASC
---
    public function getAllhistoryUsers()
    {
        return $this->select('users.*')
            ->join('auth_groups_users', 'auth_groups_users.user_id = users.id')
            ->where('users.active', 1)
            ->where('auth_groups_users.group_id', 1)
            ->orderBy('users.username', 'ASC')
            ->findAll();

SELECT `users`.*
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `users`.`id` = '1'
AND `auth_groups_users`.`group_id` = 1
 LIMIT 1
---
    public function getAdminUserById($userId)
    {
        return $this->select('users.*')
            ->join('auth_groups_users', 'auth_groups_users.user_id = users.id')
            ->where('users.id', $userId)
            ->where('auth_groups_users.group_id', 1) // 1 untuk admin
            ->first();